# Data Cleaning - Part 1

In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [17]:
#File 1) circuits.csv
df1 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\circuits.csv")

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   circuitId   77 non-null     int64
 1   circuitRef  77 non-null     object
 2   name        77 non-null     object
 3   location    77 non-null     object
 4   country     77 non-null     object
 5   lat         77 non-null     float64
 6   lng         77 non-null     float64
 7   alt         77 non-null     object
 8   url         77 non-null     object
dtypes: float64(2), int64(1), object(6)
memory usage: 5.5+ KB

In [19]:
#Observations:
#There have been 77 Formula 1 circuits till date
#No missing values observed

In [20]:
df1.head(2)

,circuitId,circuitRef,name,location,country,lat,lng,alt,url
0,1,albert_park,Albert Park Grand Prix Circuit,Melbourne,Australia,-37.84970,144.968,10,http://en.wikipedia.org/wiki/Melbourne_Grand_P...
1,2,sepang,Sepang International Circuit,Kuala Lumpur,Malaysia,2.76083,101.738,18,http://en.wikipedia.org/wiki/Sepang_Internatio...

In [21]:
#Dropping unnecessary columns

df1.drop(columns=['circuitRef', 'lat', 'lng', 'alt', 'url'], inplace=True)

In [22]:
df1.head(2)

   circuitId                            name      location    country
0          1  Albert Park Grand Prix Circuit     Melbourne  Australia
1          2    Sepang International Circuit  Kuala Lumpur   Malaysia

In [23]:
df1.rename(columns = {'name': 'circuit_name'})

,circuitId,circuit_name,location,country
0,1,Albert Park Grand Prix Circuit,Melbourne,Australia
1,2,Sepang International Circuit,Kuala Lumpur,Malaysia
2,3,Bahrain International Circuit,Sakhir,Bahrain
3,4,Circuit de Barcelona-Catalunya,Montmeló,Spain
4,5,Istanbul Park,Istanbul,Turkey
...,...,...,...,...
72,75,Autódromo Internacional do Algarve,Portimão,Portugal
73,76,Autodromo Internazionale del Mugello,Mugello,Italy
74,77,Jeddah Corniche Circuit,Jeddah,Saudi Arabia
75,78,Losail International Circuit,Al Daayen,Qatar
76,79,Miami International Autodrome,Miami,USA

In [24]:
df1['circuitId'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 80, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71, 73, 75, 76, 77, 78, 79], dtype=int64)

In [25]:
#File 2) constructor_results
df2 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\constructor_results.csv")

In [26]:
df2.head(5)

   constructorResultsId  raceId  constructorId  points status
0                     1      18              1    14.0     \N
1                     2      18              2     8.0     \N
2                     3      18              3     9.0     \N
3                     4      18              4     5.0     \N
4                     5      18              5     2.0     \N

In [27]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12290 entries, 0 to 12289
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   constructorResultsId  12290 non-null  int64
 1   raceId                12290 non-null  int64
 2   constructorId         12290 non-null  int64
 3   points                12290 non-null  float64
 4   status                12290 non-null  object
dtypes: float64(1), int64(3), object(1)
memory usage: 480.2+ KB

In [28]:
df2.shape

(12290, 5)

In [29]:
#Observations:
#No Null values seen
#All columns seem important for analysis
#So I'll proceed to the next file

In [30]:
#File 3) constructor_standings
df3 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\constructor_standings.csv")

In [31]:
df3.shape

(13051, 7)

In [32]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13051 entries, 0 to 13050
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   constructorStandingsId  13051 non-null  int64
 1   raceId                  13051 non-null  int64
 2   constructorId           13051 non-null  int64
 3   points                  13051 non-null  float64
 4   position                13051 non-null  int64
 5   positionText            13051 non-null  object
 6   wins                    13051 non-null  int64
dtypes: float64(1), int64(5), object(1)
memory usage: 713.9+ KB

In [33]:
df3.head()

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1
1,2,18,2,8.0,3,3,0
2,3,18,3,9.0,2,2,0
3,4,18,4,5.0,4,4,0
4,5,18,5,2.0,5,5,0

In [34]:
#Observations:
#No null values seen.

In [35]:
df3['position'].unique()

array([ 1,  3,  2,  4,  5,  6,  8,  7,  9, 10, 11, 12, 13, 14, 15, 18, 17,
       16, 19, 20, 21, 22], dtype=int64)

In [36]:
df3['positionText'].unique()

array(['1', '3', '2', '4', '5', '6', '8', '7', '9', '10', '11', 'E', '12',
       '13', '14', '15', '18', '17', '16', '19', '20', '21', '22'],
      dtype=object)

In [37]:
filt=(df3['positionText']=='E')
df3[filt].head(2)

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
217,25756,38,1,44.0,11,E,1
227,25767,39,1,58.0,11,E,1

In [38]:
#Could not figure out what 'E' in the positionText stood for
#Anyways dropping the column

In [39]:
df3.drop(columns=['positionText'], inplace=True)

In [40]:
df3.head(2)

   constructorStandingsId  raceId  constructorId  points  position  wins
0                       1      18              1    14.0         1     1
1                       2      18              2     8.0         3     0

In [41]:
#File 4) constructors.csv
df4 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\constructors.csv")

In [42]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211 entries, 0 to 210
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   constructorId   211 non-null    int64
 1   constructorRef  211 non-null    object
 2   name            211 non-null    object
 3   nationality     211 non-null    object
 4   url             211 non-null    object
dtypes: int64(1), object(4)
memory usage: 8.4+ KB

In [43]:
#observations:
#No null values seen.

In [44]:
df4.head(2)

,constructorId,constructorRef,name,nationality,url
0,1,mclaren,McLaren,British,http://en.wikipedia.org/wiki/McLaren
1,2,bmw_sauber,BMW Sauber,German,http://en.wikipedia.org/wiki/BMW_Sauber

In [45]:
df4.drop(columns={'constructorRef', 'url'}, inplace=True)

In [46]:
df4.head(2)

   constructorId        name nationality
0              1     McLaren     British
1              2  BMW Sauber      German

In [47]:
#File 5) driver_standings.csv
df5 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\driver_standings.csv")

In [48]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34124 entries, 0 to 34123
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   driverStandingsId  34124 non-null  int64
 1   raceId             34124 non-null  int64
 2   driverId           34124 non-null  int64
 3   points             34124 non-null  float64
 4   position           34124 non-null  int64
 5   positionText       34124 non-null  object
 6   wins               34124 non-null  int64
dtypes: float64(1), int64(5), object(1)
memory usage: 1.8+ MB

In [49]:
#Observations:
#No null values seen

In [50]:
df5.head(2)

   driverStandingsId  raceId  driverId  points  position positionText  wins
0                  1      18         1    10.0         1            1     1
1                  2      18         2     8.0         2            2     0

In [51]:
df5['positionText'].unique()

array(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12',
       '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23',
       '24', '25', '27', '26', 'D', '28', '29', '30', '31', '33', '32',
       '34', '36', '35', '38', '39', '37', '45', '41', '46', '42', '40',
       '43', '44', '47', '49', '48', '51', '50', '52', '53', '55', '54',
       '57', '56', '58', '59', '61', '60', '62', '66', '65', '63', '64',
       '69', '68', '67', '73', '72', '71', '70', '75', '74', '77', '76',
       '78', '83', '81', '80', '88', '87', '84', '82', '86', '85', '79',
       '91', '90', '89', '92', '93', '94', '95', '96', '97', '98', '103',
       '102', '101', '99', '100', '104', '108', '107', '105', '106'],
      dtype=object)

In [52]:
df5['position'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  27,
        26,  28,  29,  30,  31,  33,  32,  34,  36,  35,  38,  39,  37,
        45,  41,  46,  42,  40,  43,  44,  47,  49,  48,  51,  50,  52,
        53,  55,  54,  57,  56,  58,  59,  61,  60,  62,  66,  65,  63,
        64,  69,  68,  67,  73,  72,  71,  70,  75,  74,  77,  76,  78,
        83,  81,  80,  88,  87,  84,  82,  86,  85,  79,  91,  90,  89,
        92,  93,  94,  95,  96,  97,  98, 103, 102, 101,  99, 100, 104,
       108, 107, 105, 106], dtype=int64)

In [53]:
df5.drop(columns={'positionText'}, inplace=True)

In [54]:
df5.head(2)

   driverStandingsId  raceId  driverId  points  position  wins
0                  1      18         1    10.0         1     1
1                  2      18         2     8.0         2     0

In [55]:
#File 6) drivers.csv
df6 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\drivers.csv")

In [56]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 857 entries, 0 to 856
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   driverId     857 non-null    int64
 1   driverRef    857 non-null    object
 2   number       857 non-null    object
 3   code         857 non-null    object
 4   forename     857 non-null    object
 5   surname      857 non-null    object
 6   dob          857 non-null    object
 7   nationality  857 non-null    object
 8   url          857 non-null    object
dtypes: int64(1), object(8)
memory usage: 60.4+ KB

In [57]:
#Observations:
#No null values seen

In [58]:
df6.shape

(857, 9)

In [59]:
df6.head()

,driverId,driverRef,number,code,forename,surname,dob,nationality,url
0,1,hamilton,44,HAM,Lewis,Hamilton,1985-01-07,British,http://en.wikipedia.org/wiki/Lewis_Hamilton
1,2,heidfeld,\N,HEI,Nick,Heidfeld,1977-05-10,German,http://en.wikipedia.org/wiki/Nick_Heidfeld
2,3,rosberg,6,ROS,Nico,Rosberg,1985-06-27,German,http://en.wikipedia.org/wiki/Nico_Rosberg
3,4,alonso,14,ALO,Fernando,Alonso,1981-07-29,Spanish,http://en.wikipedia.org/wiki/Fernando_Alonso
4,5,kovalainen,\N,KOV,Heikki,Kovalainen,1981-10-19,Finnish,http://en.wikipedia.org/wiki/Heikki_Kovalainen

In [60]:
#We already have driver forename and surame, thus dropping driverRef
#Driver code will be useful in plotting graphs
df6.drop(columns={'driverRef', 'number', 'url'}, inplace=True)
df6.head(2)

   driverId code forename   surname         dob nationality
0         1  HAM    Lewis  Hamilton  1985-01-07     British
1         2  HEI     Nick  Heidfeld  1977-05-10      German

In [61]:
#changig dob from string to Date-Time format
#Note: Not calculating driver age yet, will do once all season info is available

df6['dob'] = pd.to_datetime(df6['dob'], format='%Y-%m-%d')

In [62]:
df6.head(2)

   driverId code forename   surname        dob nationality
0         1  HAM    Lewis  Hamilton 1985-01-07     British
1         2  HEI     Nick  Heidfeld 1977-05-10      German

In [63]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 857 entries, 0 to 856
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   driverId     857 non-null    int64
 1   code         857 non-null    object
 2   forename     857 non-null    object
 3   surname      857 non-null    object
 4   dob          857 non-null    datetime64[ns]
 5   nationality  857 non-null    object
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 40.3+ KB

In [64]:
#File 7) lap_times.csv
df7 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\lap_times.csv")

In [65]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 551742 entries, 0 to 551741
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   raceId        551742 non-null  int64
 1   driverId      551742 non-null  int64
 2   lap           551742 non-null  int64
 3   position      551742 non-null  int64
 4   time          551742 non-null  object
 5   milliseconds  551742 non-null  int64
dtypes: int64(5), object(1)
memory usage: 25.3+ MB

In [66]:
#No null values seen
df7.head()

   raceId  driverId  lap  position      time  milliseconds
0     841        20    1         1  1:38.109         98109
1     841        20    2         1  1:33.006         93006
2     841        20    3         1  1:32.713         92713
3     841        20    4         1  1:32.803         92803
4     841        20    5         1  1:32.342         92342

In [67]:
df7['milliseconds'].nlargest(5)

8372    7507547
8020    7506656
8426    7506243
8621    7506095
7916    7505152
Name: milliseconds, dtype: int64

In [68]:
#Not dropping milliseconds yet, might help in plotting graphs later
#Time is a string, changing it to time format
#Since some entries in the time columns are of the format='%H:%M:%S.%f' while some of format='%M:%S.%f' 
# I got an error while using df7['time'] = pd.to_datetime(df7['time'], format='%H:%M:%S.%f')

In [69]:
#Converting milliseconds column to timedelta
df7['time_delta'] = df7['milliseconds'].apply(lambda x: pd.to_timedelta(x, unit='ms'))

In [70]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 551742 entries, 0 to 551741
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   raceId        551742 non-null  int64
 1   driverId      551742 non-null  int64
 2   lap           551742 non-null  int64
 3   position      551742 non-null  int64
 4   time          551742 non-null  object
 5   milliseconds  551742 non-null  int64
 6   time_delta    551742 non-null  timedelta64[ns]
dtypes: int64(5), object(1), timedelta64[ns](1)
memory usage: 29.5+ MB

In [71]:
df7.head(2)

,raceId,driverId,lap,position,time,milliseconds,time_delta
0,841,20,1,1,1:38.109,98109,0 days 00:01:38.109000
1,841,20,2,1,1:33.006,93006,0 days 00:01:33.006000

In [72]:
df7.drop(columns={'time'}, inplace=True)

In [73]:
df7.rename(columns={'time_delta': 'time'}, inplace=True)

In [74]:
df7['time'].nlargest()

8372   0 days 02:05:07.547000
8020   0 days 02:05:06.656000
8426   0 days 02:05:06.243000
8621   0 days 02:05:06.095000
7916   0 days 02:05:05.152000
Name: time, dtype: timedelta64[ns]

In [75]:
df7.head(2)

   raceId  driverId  lap  position  milliseconds                   time
0     841        20    1         1         98109 0 days 00:01:38.109000
1     841        20    2         1         93006 0 days 00:01:33.006000

In [76]:
#File 8) pit_stops.csv
df8=pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\pit_stops.csv")

In [77]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10089 entries, 0 to 10088
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   raceId        10089 non-null  int64
 1   driverId      10089 non-null  int64
 2   stop          10089 non-null  int64
 3   lap           10089 non-null  int64
 4   time          10089 non-null  object
 5   duration      10089 non-null  object
 6   milliseconds  10089 non-null  int64
dtypes: int64(5), object(2)
memory usage: 551.9+ KB

In [78]:
df8.head(10)

   raceId  driverId  stop  lap      time duration  milliseconds
0     841       153     1    1  17:05:23   26.898         26898
1     841        30     1    1  17:05:52   25.021         25021
2     841        17     1   11  17:20:48   23.426         23426
3     841         4     1   12  17:22:34   23.251         23251
4     841        13     1   13  17:24:10   23.842         23842
5     841        22     1   13  17:24:29   23.643         23643
6     841        20     1   14  17:25:17   22.603         22603
7     841       814     1   14  17:26:03   24.863         24863
8     841       816     1   14  17:26:50   25.259         25259
9     841        67     1   15  17:27:34   25.342         25342

In [79]:
#Here, time denotes the time at which driver entered the pit
#duration is the time lost in the pit lane
#We can drop time & duration and convert milliseconds to time_delta (if required)

In [80]:
df8.drop(columns={'time', 'duration'}, inplace=True)

In [81]:
df8['milliseconds'].nlargest()

9156    3069017
9155    3067301
9157    3065174
9154    3063613
9152    3063314
Name: milliseconds, dtype: int64

In [82]:
#Pretty large pit stops can be seen, indicating major repairs, or incidents

In [83]:
df8.head(2)

   raceId  driverId  stop  lap  milliseconds
0     841       153     1    1         26898
1     841        30     1    1         25021

In [84]:
#File 9) qualifying.csv
df9=pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\qualifying.csv")

In [85]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9815 entries, 0 to 9814
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   qualifyId      9815 non-null   int64
 1   raceId         9815 non-null   int64
 2   driverId       9815 non-null   int64
 3   constructorId  9815 non-null   int64
 4   number         9815 non-null   int64
 5   position       9815 non-null   int64
 6   q1             9807 non-null   object
 7   q2             9651 non-null   object
 8   q3             9488 non-null   object
dtypes: int64(6), object(3)
memory usage: 690.2+ KB

In [86]:
df9.head(2)

,qualifyId,raceId,driverId,constructorId,number,position,q1,q2,q3
0,1,18,1,1,22,1,1:26.572,1:25.187,1:26.714
1,2,18,9,2,4,2,1:26.103,1:25.315,1:26.869

In [87]:
# Replace '\N' with '0:00:000' in columns 'q1', 'q2', and 'q3' of the DataFrame
df9[['q1', 'q2', 'q3']] = df9[['q1', 'q2', 'q3']].replace('\\N', '0:00.000')

In [88]:
#Converting q1, q2, q3 from string to tome format
df9['q1'] = pd.to_datetime(df9['q1'], format='%M:%S.%f')
df9['q2'] = pd.to_datetime(df9['q2'], format='%M:%S.%f')
df9['q3'] = pd.to_datetime(df9['q3'], format='%M:%S.%f')

In [89]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9815 entries, 0 to 9814
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   qualifyId      9815 non-null   int64
 1   raceId         9815 non-null   int64
 2   driverId       9815 non-null   int64
 3   constructorId  9815 non-null   int64
 4   number         9815 non-null   int64
 5   position       9815 non-null   int64
 6   q1             9807 non-null   datetime64[ns]
 7   q2             9651 non-null   datetime64[ns]
 8   q3             9488 non-null   datetime64[ns]
dtypes: datetime64[ns](3), int64(6)
memory usage: 690.2 KB

In [90]:
#File 10) races.csv
df10=pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\races.csv")

In [91]:
df10.head(2)

,raceId,year,round,circuitId,name,date,time,url,fp1_date,fp1_time,fp2_date,fp2_time,fp3_date,fp3_time,quali_date,quali_time,sprint_date,sprint_time
0,1,2009,1,1,Australian Grand Prix,2009-03-29,06:00:00,http://en.wikipedia.org/wiki/2009_Australian_G...,\N,\N,\N,\N,\N,\N,\N,\N,\N,\N
1,2,2009,2,2,Malaysian Grand Prix,2009-04-05,09:00:00,http://en.wikipedia.org/wiki/2009_Malaysian_Gr...,\N,\N,\N,\N,\N,\N,\N,\N,\N,\N

In [92]:
#Slicing useful columns
df10 = df10.iloc[:, 0:4]

In [93]:
df10.head(2)

   raceId  year  round  circuitId
0       1  2009      1          1
1       2  2009      2          2

In [94]:
# File 11)
df11=pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\results.csv")

In [95]:
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26080 entries, 0 to 26079
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   resultId         26080 non-null  int64
 1   raceId           26080 non-null  int64
 2   driverId         26080 non-null  int64
 3   constructorId    26080 non-null  int64
 4   number           26080 non-null  object
 5   grid             26080 non-null  int64
 6   position         26080 non-null  object
 7   positionText     26080 non-null  object
 8   positionOrder    26080 non-null  int64
 9   points           26080 non-null  float64
 10  laps             26080 non-null  int64
 11  time             26080 non-null  object
 12  milliseconds     26080 non-null  object
 13  fastestLap       26080 non-null  object
 14  rank             26080 non-null  object
 15  fastestLapTime   26080 non-null  object
 16  fastestLapSpeed  26080 non-null  object
 17  statusId         26080 non-null  int64
dtypes: float64(1), int64(8), object(9)
memory usage: 3.6+ MB

In [96]:
df11.head()

,resultId,raceId,driverId,constructorId,number,grid,position,positionText,positionOrder,points,laps,time,milliseconds,fastestLap,rank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,22,1,1,1,1,10.0,58,1:34:50.616,5690616,39,2,1:27.452,218.300,1
1,2,18,2,2,3,5,2,2,2,8.0,58,+5.478,5696094,41,3,1:27.739,217.586,1
2,3,18,3,3,7,7,3,3,3,6.0,58,+8.163,5698779,41,5,1:28.090,216.719,1
3,4,18,4,4,5,11,4,4,4,5.0,58,+17.181,5707797,58,7,1:28.603,215.464,1
4,5,18,5,1,23,3,5,5,5,4.0,58,+18.014,5708630,43,1,1:27.418,218.385,1

In [97]:
#Dropping position and positionText because positionOrder has all Integers
#Dropping time, because handling milliseconds would be easier
df11.drop(columns={'position', 'positionText', 'time', 'number'}, inplace=True)

In [98]:
df11.head(2)

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,rank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,1,1,10.0,58,5690616,39,2,1:27.452,218.300,1
1,2,18,2,2,5,2,8.0,58,5696094,41,3,1:27.739,217.586,1

In [99]:
#Handling Missing Values 
# Replace '\N' with '0' in columns milliseconds, fastestLap, rank & fastestLapSpeed
df11[['milliseconds', 'fastestLap', 'rank', 'fastestLapSpeed']] = df11[['milliseconds', 'fastestLap', 'rank', 'fastestLapSpeed']].replace('\\N', '0')

In [100]:
 # Replace '\N' with '0:00.000' in column fastestLapTime
df11[['fastestLapTime']] = df11[['fastestLapTime']].replace('\\N', '0:0.000')

In [101]:
#Converting column milliseconds, fastestLap, rank from string to int format
df11[['milliseconds', 'fastestLap', 'rank']] = df11[['milliseconds', 'fastestLap', 'rank']].astype(int)

In [102]:
#Converting column fastestLapSpeed string to float format
df11['fastestLapSpeed'] = df11['fastestLapSpeed'].astype(float)

In [103]:
#Converting column fastestLapTime from string to time format
df11['fastestLapTime'] = pd.to_datetime(df11['fastestLapTime'], format='%M:%S.%f')

In [104]:
df11.rename(columns={'rank':'fastestLapRank'}, inplace=True)

In [105]:
df11.head(2)

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,fastestLapRank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,1,1,10.0,58,5690616,39,2,1900-01-01 00:01:27.452,218.300,1
1,2,18,2,2,5,2,8.0,58,5696094,41,3,1900-01-01 00:01:27.739,217.586,1

In [106]:
# Extract minute, seconds, and milliseconds
df11['fastestLapTime'] = df11['fastestLapTime'].dt.strftime('%M:%S.%f').str.slice(0, -3)

In [107]:
df11.head(2)

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,fastestLapRank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,1,1,10.0,58,5690616,39,2,01:27.452,218.300,1
1,2,18,2,2,5,2,8.0,58,5696094,41,3,01:27.739,217.586,1

In [108]:
#File 12) seasons.csv
df12=pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\seasons.csv")

In [109]:
df12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    74 non-null     int64
 1   url     74 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.3+ KB

In [110]:
df12.head(2)

   year                                                url
0  2009  http://en.wikipedia.org/wiki/2009_Formula_One_...
1  2008  http://en.wikipedia.org/wiki/2008_Formula_One_...

In [111]:
#This file is not useful in any analysis, hence moving on

In [112]:
#File 13) sprint_results.csv
df13=pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\sprint_results.csv")

In [113]:
df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   resultId        180 non-null    int64
 1   raceId          180 non-null    int64
 2   driverId        180 non-null    int64
 3   constructorId   180 non-null    int64
 4   number          180 non-null    int64
 5   grid            180 non-null    int64
 6   position        180 non-null    object
 7   positionText    180 non-null    object
 8   positionOrder   180 non-null    int64
 9   points          180 non-null    int64
 10  laps            180 non-null    int64
 11  time            180 non-null    object
 12  milliseconds    180 non-null    object
 13  fastestLap      180 non-null    object
 14  fastestLapTime  180 non-null    object
 15  statusId        180 non-null    int64
dtypes: int64(10), object(6)
memory usage: 22.6+ KB

In [114]:
#Almost all preprocessing steps are same as those for File 11: results.csv
#Dropping useless columns
df13.drop(columns={'number', 'position', 'positionText', 'time'}, inplace=True)

In [115]:
df13.head()

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,fastestLapTime,statusId
0,1,1061,830,9,2,1,3,17,1538426,14,1:30.013,1
1,2,1061,1,131,1,2,2,17,1539856,17,1:29.937,1
2,3,1061,822,131,3,3,1,17,1545928,17,1:29.958,1
3,4,1061,844,6,4,4,0,17,1549704,16,1:30.163,1
4,5,1061,846,1,6,5,0,17,1562537,16,1:30.566,1

In [116]:
#Handling Missing Values and Formatting the respective columns
# Replace '\N' with '0' in columns milliseconds & fastestLap
df13[['milliseconds', 'fastestLap']] = df13[['milliseconds', 'fastestLap']].replace('\\N', '0')
 # Replace '\N' with '0:00.000' in column fastestLapTime
df13[['fastestLapTime']] = df13[['fastestLapTime']].replace('\\N', '0:0.000')   

#Converting column milliseconds, fastestLap, rank from string to int format
df13[['milliseconds', 'fastestLap']] = df13[['milliseconds', 'fastestLap']].astype(int)
#Converting column fastestLapTime from string to time format
df13['fastestLapTime'] = pd.to_datetime(df13['fastestLapTime'], format='%M:%S.%f')

In [117]:
df13.dtypes

resultId                   int64
raceId                     int64
driverId                   int64
constructorId              int64
grid                       int64
positionOrder              int64
points                     int64
laps                       int64
milliseconds               int32
fastestLap                 int32
fastestLapTime    datetime64[ns]
statusId                   int64
dtype: object

In [118]:
df13['raceId'].unique()

array([1061, 1065, 1071, 1077, 1084, 1095, 1101, 1107, 1110], dtype=int64)

In [119]:
#Feature Engineering: Creating the 'fastestLapRank' column
df13['fastestLapRank'] = df13.groupby('raceId')['fastestLapTime'].rank().astype(int)

In [213]:
df13.head(2)

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,fastestLapTime,statusId,fastestLapRank
0,1,1061,830,9,2,1,3,17,1538426,14,01:30.013,1,3
1,2,1061,1,131,1,2,2,17,1539856,17,01:29.937,1,1

In [121]:
# Extract minute, seconds, and milliseconds
df13['fastestLapTime'] = df13['fastestLapTime'].dt.strftime('%M:%S.%f').str.slice(0, -3)

In [122]:
df13.head(2)

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,fastestLapTime,statusId,fastestLapRank
0,1,1061,830,9,2,1,3,17,1538426,14,01:30.013,1,3
1,2,1061,1,131,1,2,2,17,1539856,17,01:29.937,1,1

In [123]:
#File 14) status.csv
df14=pd.read_csv(r"C:\Users\sulet\Desktop\F1_History\status.csv")

In [124]:
df14.head()

   statusId        status
0         1      Finished
1         2  Disqualified
2         3      Accident
3         4     Collision
4         5        Engine

In [125]:
#This file has all the possible results for each car on the track
#This is best left untouched

In [127]:
#Saving all the preprocessed files in local machine

df1.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_circuits.csv", index=False)
df2.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructor_results.csv", index=False)
df3.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructor_standings.csv", index=False)
df4.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructors.csv", index=False)
df5.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_driver_standings.csv", index=False)
df6.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_drivers.csv", index=False)
df7.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_lap_times.csv", index=False)
df8.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_pit_stops.csv", index=False)
df9.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_qualifying.csv", index=False)
df10.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_races.csv", index=False)
df11.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_results.csv", index=False)
df12.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_seasons.csv", index=False)
df13.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_sprint_results.csv", index=False)
df14.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_status.csv", index=False)

# Data Cleaning - Part 2

In [128]:
df1.head()

   circuitId                            name      location    country
0          1  Albert Park Grand Prix Circuit     Melbourne  Australia
1          2    Sepang International Circuit  Kuala Lumpur   Malaysia
2          3   Bahrain International Circuit        Sakhir    Bahrain
3          4  Circuit de Barcelona-Catalunya      Montmeló      Spain
4          5                   Istanbul Park      Istanbul     Turkey

In [131]:
df1.rename(columns={'name':'circuit_name', 'location':'circuit_location', 'country':'circuit_country'}, inplace=True)

In [132]:
df1.head(2)

   circuitId                    circuit_name circuit_location circuit_country
0          1  Albert Park Grand Prix Circuit        Melbourne       Australia
1          2    Sepang International Circuit     Kuala Lumpur        Malaysia

In [140]:
df2.head()

   constructorResultsId  raceId  constructorId  points
0                     1      18              1    14.0
1                     2      18              2     8.0
2                     3      18              3     9.0
3                     4      18              4     5.0
4                     5      18              5     2.0

In [135]:
df2['status'].value_counts()

status
\N    12273
D        17
Name: count, dtype: int64

In [137]:
df2.drop(columns={'status'}, inplace=True)

In [144]:
df3.head(3)

   constructorStandingsId  raceId  constructorId  points  position  wins
0                       1      18              1    14.0         1     1
1                       2      18              2     8.0         3     0
2                       3      18              3     9.0         2     0

In [155]:
df5.head()

   driverStandingsId  raceId  driverId  points  position  wins
0                  1      18         1    10.0         1     1
1                  2      18         2     8.0         2     0
2                  3      18         3     6.0         3     0
3                  4      18         4     5.0         4     0
4                  5      18         5     4.0         5     0

In [160]:
#Driver and Constructor nationalities are given as British for UK etc
#So, for better analysis, I'll introduce a featues: driver_home and constructor_home

In [145]:
df4.head(2)

   constructorId        name nationality
0              1     McLaren     British
1              2  BMW Sauber      German

In [171]:
df4.rename(columns={'name':'constructor_name', 'nationality':'constructor_nationality'}, inplace=True)

In [172]:
df4['constructor_nationality'].unique()

array(['British', 'German', 'French', 'Italian', 'Japanese', 'Austrian',
       'Indian', 'Dutch', 'Russian', 'Swiss', 'Irish', 'Hong Kong',
       'Brazilian', 'Canadian', 'Mexican', 'American', 'Australian',
       'New Zealander', 'South African', 'Rhodesian', 'Belgian',
       'East German', 'Spanish', 'Malaysian'], dtype=object)

In [179]:
#To make things easier, 'East German' : 'German' in constructor_nationality
df4['constructor_nationality'] = df4['constructor_nationality'].replace('East German', 'German')

In [180]:
df4['constructor_nationality'].unique()

array(['British', 'German', 'French', 'Italian', 'Japanese', 'Austrian',
       'Indian', 'Dutch', 'Russian', 'Swiss', 'Irish', 'Hong Kong',
       'Brazilian', 'Canadian', 'Mexican', 'American', 'Australian',
       'New Zealander', 'South African', 'Rhodesian', 'Belgian',
       'Spanish', 'Malaysian'], dtype=object)

In [181]:
df6.head(2)

,driverId,driver_code,driver_forename,driver_surname,driver_dob,driver_nationality
0,1,HAM,Lewis,Hamilton,1985-01-07,British
1,2,HEI,Nick,Heidfeld,1977-05-10,German

In [174]:
df6.rename(columns={'code':'driver_code', 'forename':'driver_forename', 'surname':'driver_surname', 'dob':'driver_dob', 'nationality':'driver_nationality'}, inplace=True)

In [175]:
df6['driver_nationality'].unique()

array(['British', 'German', 'Spanish', 'Finnish', 'Japanese', 'French',
       'Polish', 'Brazilian', 'Italian', 'Australian', 'Austrian',
       'American', 'Dutch', 'Colombian', 'Portuguese', 'Canadian',
       'Indian', 'Hungarian', 'Irish', 'Danish', 'Argentine', 'Czech',
       'Malaysian', 'Swiss', 'Belgian', 'Monegasque', 'Swedish',
       'Venezuelan', 'New Zealander', 'Chilean', 'Mexican',
       'South African', 'Liechtensteiner', 'Rhodesian',
       'American-Italian', 'Uruguayan', 'Argentine-Italian', 'Thai',
       'East German', 'Russian', 'Indonesian', 'Chinese'], dtype=object)

In [184]:
#'American-Italian': 'USA', 'Argentine-Italian': 'Argentina' in driver nationality 
df6['driver_nationality'] = df6['driver_nationality'].replace('East German', 'German')
df6['driver_nationality'] = df6['driver_nationality'].replace('American-Italian', 'USA')
df6['driver_nationality'] = df6['driver_nationality'].replace('Argentine-Italian', 'Argentina')

In [185]:
df6['driver_nationality'].unique()

array(['British', 'German', 'Spanish', 'Finnish', 'Japanese', 'French',
       'Polish', 'Brazilian', 'Italian', 'Australian', 'Austrian',
       'American', 'Dutch', 'Colombian', 'Portuguese', 'Canadian',
       'Indian', 'Hungarian', 'Irish', 'Danish', 'Argentine', 'Czech',
       'Malaysian', 'Swiss', 'Belgian', 'Monegasque', 'Swedish',
       'Venezuelan', 'New Zealander', 'Chilean', 'Mexican',
       'South African', 'Liechtensteiner', 'Rhodesian', 'USA',
       'Uruguayan', 'Argentina', 'Thai', 'Russian', 'Indonesian',
       'Chinese'], dtype=object)

In [259]:
# Dictionary mapping countries to nationalities
nationality_to_country = {
    'British': 'UK',
    'German': 'Germany',
    'French': 'France',
    'Italian': 'Italy',
    'Japanese': 'Japan',
    'Austrian': 'Austria',
    'Indian': 'India',
    'Dutch': 'Netherlands',
    'Russian': 'Russia',
    'Swiss': 'Switzerland',
    'Irish': 'Ireland',
    'Hong Kong': 'Hong Kong',
    'Brazilian': 'Brazil',
    'Canadian': 'Canada',
    'Mexican': 'Mexico',
    'American': 'USA',
    'Australian': 'Australia',
    'New Zealander': 'New Zealand',
    'South African': 'South Africa',
    'Rhodesian': 'Rhodesia',
    'Belgian': 'Belgium',
    'East German': 'East Germany',
    'Spanish': 'Spain',
    'Malaysian': 'Malaysia',
    'Finnish': 'Finland',
    'Polish': 'Poland',
    'Colombian': 'Colombia',
    'Portuguese': 'Portugal',
    'Hungarian': 'Hungary',
    'Danish': 'Denmark',
    'Argentine': 'Argentina',
    'Czech': 'Czech Republic',
    'Monegasque': 'Monaco',
    'Swedish': 'Sweden',
    'Venezuelan': 'Venezuela',
    'Chilean': 'Chile',
    'Liechtensteiner': 'Liechtenstein',
    'American-Italian': 'USA',
    'Uruguayan': 'Uruguay',
    'Argentine-Italian': 'Argentina',
    'Thai': 'Thailand',
    'Indonesian': 'Indonesia',
    'Chinese': 'China'
}

In [273]:
# Create the new 'constructor_home' column
df4['constructor_home'] = df4['constructor_nationality'].map(nationality_to_country)

In [260]:
# Create the new 'constructor_home' column
df4['constructor_home'] = df4['constructor_nationality'].map(nationality_to_country)

In [191]:
df4.head(2)

   constructorId constructor_name constructor_nationality constructor_home
0              1          McLaren                 British               UK
1              2       BMW Sauber                  German          Germany

In [261]:
# Create the new 'driver_home' column
df6['driver_home'] = df6['driver_nationality'].map(nationality_to_country)

In [194]:
df6.head(2)

,driverId,driver_code,driver_forename,driver_surname,driver_dob,driver_nationality,driver_home
0,1,HAM,Lewis,Hamilton,1985-01-07,British,UK
1,2,HEI,Nick,Heidfeld,1977-05-10,German,Germany

In [197]:
df1.head(2)

   circuitId                    circuit_name circuit_location circuit_country
0          1  Albert Park Grand Prix Circuit        Melbourne       Australia
1          2    Sepang International Circuit     Kuala Lumpur        Malaysia

In [ ]:
#To make things easier, 'United States' : 'USA' in the'circuit_country' column
df1['circuit_country'] = df1['circuit_country'].replace('United States', 'USA')

In [198]:
df1['circuit_country'].unique()

array(['Australia', 'Malaysia', 'Bahrain', 'Spain', 'Turkey', 'Monaco',
       'Canada', 'France', 'UK', 'Germany', 'Hungary', 'Belgium', 'Italy',
       'Singapore', 'Japan', 'China', 'Brazil', 'USA', 'UAE', 'Argentina',
       'Portugal', 'South Africa', 'Mexico', 'Korea', 'Netherlands',
       'Sweden', 'Austria', 'Morocco', 'Switzerland', 'India', 'Russia',
       'Azerbaijan', 'Saudi Arabia', 'Qatar'], dtype=object)

In [199]:
#Introducing circuit_nationality
# Dictionary mapping countries to nationalities
country_to_nationality = {
    'Australia': 'Australian',
    'Malaysia': 'Malaysian',
    'Bahrain': 'Bahraini',
    'Spain': 'Spanish',
    'Turkey': 'Turkish',
    'Monaco': 'Monegasque',
    'Canada': 'Canadian',
    'France': 'French',
    'UK': 'British',
    'Germany': 'German',
    'Hungary': 'Hungarian',
    'Belgium': 'Belgian',
    'Italy': 'Italian',
    'Singapore': 'Singaporean',
    'Japan': 'Japanese',
    'China': 'Chinese',
    'Brazil': 'Brazilian',
    'USA': 'American',
    'UAE': 'Emirati',
    'Argentina': 'Argentine',
    'Portugal': 'Portuguese',
    'South Africa': 'South African',
    'Mexico': 'Mexican',
    'Korea': 'South Korean',
    'Netherlands': 'Dutch',
    'Sweden': 'Swedish',
    'Austria': 'Austrian',
    'Morocco': 'Moroccan',
    'Switzerland': 'Swiss',
    'India': 'Indian',
    'Russia': 'Russian',
    'Azerbaijan': 'Azerbaijani',
    'Saudi Arabia': 'Saudi Arabian',
    'Qatar': 'Qatari'
}

In [200]:
# Create the new 'circuit_nationality' column
df1['circuit_nationality'] = df1['circuit_country'].map(country_to_nationality)

In [203]:
df1.head(2)

,circuitId,circuit_name,circuit_location,circuit_country,circuit_nationality
0,1,Albert Park Grand Prix Circuit,Melbourne,Australia,Australian
1,2,Sepang International Circuit,Kuala Lumpur,Malaysia,Malaysian

In [206]:
df7.head(2)

   raceId  driverId  lap  position  milliseconds                   time
0     841        20    1         1         98109 0 days 00:01:38.109000
1     841        20    2         1         93006 0 days 00:01:33.006000

In [209]:
df7.drop(columns='milliseconds', inplace=True)

In [211]:
df7.rename(columns={'time':'lap_time'}, inplace=True)

In [217]:
df7.head(2)

   raceId  driverId  lap  position               lap_time
0     841        20    1         1 0 days 00:01:38.109000
1     841        20    2         1 0 days 00:01:33.006000

In [219]:
df8.head(2)

   raceId  driverId  stop  lap  milliseconds
0     841       153     1    1         26898
1     841        30     1    1         25021

In [220]:
df9.head(2)

,qualifyId,raceId,driverId,constructorId,number,position,q1,q2,q3
0,1,18,1,1,22,1,1900-01-01 00:01:26.572,1900-01-01 00:01:25.187,1900-01-01 00:01:26.714
1,2,18,9,2,4,2,1900-01-01 00:01:26.103,1900-01-01 00:01:25.315,1900-01-01 00:01:26.869

In [228]:
# Remove days from the 'q1', 'q2', 'q3' columns
df9['q1'] = df9['q1'] - df9['q1'].dt.floor('D')
df9['q2'] = df9['q2'] - df9['q2'].dt.floor('D')
df9['q3'] = df9['q3'] - df9['q3'].dt.floor('D')

In [229]:
df9.head(2)

,qualifyId,raceId,driverId,constructorId,number,position,q1,q2,q3
0,1,18,1,1,22,1,0 days 00:01:26.572000,0 days 00:01:25.187000,0 days 00:01:26.714000
1,2,18,9,2,4,2,0 days 00:01:26.103000,0 days 00:01:25.315000,0 days 00:01:26.869000

In [234]:
df10.head(2)

   raceId  year  round  circuitId
0       1  2009      1          1
1       2  2009      2          2

In [236]:
df11.head(2)

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,fastestLapRank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,1,1,10.0,58,5690616,39,2,01:27.452,218.300,1
1,2,18,2,2,5,2,8.0,58,5696094,41,3,01:27.739,217.586,1

In [239]:
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26080 entries, 0 to 26079
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   resultId         26080 non-null  int64
 1   raceId           26080 non-null  int64
 2   driverId         26080 non-null  int64
 3   constructorId    26080 non-null  int64
 4   grid             26080 non-null  int64
 5   positionOrder    26080 non-null  int64
 6   points           26080 non-null  float64
 7   laps             26080 non-null  int64
 8   milliseconds     26080 non-null  int32
 9   fastestLap       26080 non-null  int32
 10  fastestLapRank   26080 non-null  int32
 11  fastestLapTime   26080 non-null  object
 12  fastestLapSpeed  26080 non-null  float64
 13  statusId         26080 non-null  int64
dtypes: float64(2), int32(3), int64(8), object(1)
memory usage: 2.5+ MB

In [240]:
# Convert 'fastestLapTime' column to timedelta
df11['fastestLapTime'] = pd.to_timedelta('00:' + df11['fastestLapTime'])

In [242]:
#dropping milliseconds
df11.drop(columns={'milliseconds'}, inplace=True)

In [244]:
df11.rename(columns={'positionOrder':'position', 'grid':'grid_position'}, inplace=True)

In [245]:
df11.head(2)

,resultId,raceId,driverId,constructorId,grid_position,position,points,laps,fastestLap,fastestLapRank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,1,1,10.0,58,39,2,0 days 00:01:27.452000,218.300,1
1,2,18,2,2,5,2,8.0,58,41,3,0 days 00:01:27.739000,217.586,1

In [246]:
df12.head(2)

   year                                                url
0  2009  http://en.wikipedia.org/wiki/2009_Formula_One_...
1  2008  http://en.wikipedia.org/wiki/2008_Formula_One_...

In [247]:
df13.head(2)

,resultId,raceId,driverId,constructorId,grid,positionOrder,points,laps,milliseconds,fastestLap,fastestLapTime,statusId,fastestLapRank
0,1,1061,830,9,2,1,3,17,1538426,14,01:30.013,1,3
1,2,1061,1,131,1,2,2,17,1539856,17,01:29.937,1,1

In [249]:
df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   resultId        180 non-null    int64
 1   raceId          180 non-null    int64
 2   driverId        180 non-null    int64
 3   constructorId   180 non-null    int64
 4   grid            180 non-null    int64
 5   positionOrder   180 non-null    int64
 6   points          180 non-null    int64
 7   laps            180 non-null    int64
 8   milliseconds    180 non-null    int32
 9   fastestLap      180 non-null    int32
 10  fastestLapTime  180 non-null    object
 11  statusId        180 non-null    int64
 12  fastestLapRank  180 non-null    int32
dtypes: int32(3), int64(9), object(1)
memory usage: 16.3+ KB

In [250]:
# Convert 'fastestLapTime' column to timedelta
df13['fastestLapTime'] = pd.to_timedelta('00:' + df13['fastestLapTime'])
#dropping milliseconds
df13.drop(columns={'milliseconds'}, inplace=True)
df13.rename(columns={'positionOrder':'position', 'grid':'grid_position'}, inplace=True)

In [253]:
df13.head(2)

,resultId,raceId,driverId,constructorId,grid_position,position,points,laps,fastestLap,fastestLapTime,statusId,fastestLapRank
0,1,1061,830,9,2,1,3,17,14,0 days 00:01:30.013000,1,3
1,2,1061,1,131,1,2,2,17,17,0 days 00:01:29.937000,1,1

In [254]:
df14.head()

   statusId        status
0         1      Finished
1         2  Disqualified
2         3      Accident
3         4     Collision
4         5        Engine

In [255]:
#Dataset is Cleaned!!!

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df1 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_circuits.csv")
df2 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructor_results.csv")
df3 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructor_standings.csv")
df4 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructors.csv")
df5 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_driver_standings.csv")
df6 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_drivers.csv")
df7 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_lap_times.csv")
df8 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_pit_stops.csv")
df9 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_qualifying.csv")
df10 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_races.csv")
df11 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_results.csv")
df12 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_seasons.csv")
df13 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_sprint_results.csv")
df14 = pd.read_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_status.csv")

In [18]:
df1.columns

Index(['circuitId', 'circuit_name', 'circuit_location', 'circuit_country',
       'circuit_nationality'],
      dtype='object')

In [19]:
df2.columns

Index(['constructorResultsId', 'raceId', 'constructorId', 'points'], dtype='object')

In [20]:
df3.columns

Index(['constructorStandingsId', 'raceId', 'constructorId', 'points',
       'position', 'wins'],
      dtype='object')

In [21]:
df4.columns

Index(['constructorId', 'constructor_name', 'constructor_nationality',
       'constructor_home'],
      dtype='object')

In [22]:
df5.columns

Index(['driverStandingsId', 'raceId', 'driverId', 'points', 'position',
       'wins'],
      dtype='object')

In [23]:
df6.columns

Index(['driverId', 'driver_code', 'driver_forename', 'driver_surname',
       'driver_dob', 'driver_nationality', 'driver_home'],
      dtype='object')

In [24]:
df7.columns

Index(['raceId', 'driverId', 'lap', 'position', 'lap_time'], dtype='object')

In [25]:
df8.columns

Index(['raceId', 'driverId', 'stop', 'lap', 'milliseconds'], dtype='object')

In [27]:
df9.columns

Index(['qualifyId', 'raceId', 'driverId', 'constructorId', 'number',
       'position', 'q1', 'q2', 'q3'],
      dtype='object')

In [28]:
df10.columns

Index(['raceId', 'year', 'round', 'circuitId'], dtype='object')

In [29]:
df11.columns

Index(['resultId', 'raceId', 'driverId', 'constructorId', 'grid_position',
       'position', 'points', 'laps', 'fastestLap', 'fastestLapRank',
       'fastestLapTime', 'fastestLapSpeed', 'statusId'],
      dtype='object')

In [30]:
df12.columns

Index(['year', 'url'], dtype='object')

In [31]:
df13.columns

Index(['resultId', 'raceId', 'driverId', 'constructorId', 'grid_position',
       'position', 'points', 'laps', 'fastestLap', 'fastestLapTime',
       'statusId', 'fastestLapRank'],
      dtype='object')

In [32]:
df14.columns

Index(['statusId', 'status'], dtype='object')

In [ ]:
#Saving all the preprocessed files in local machine

df1.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_circuits.csv", index=False)
df2.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructor_results.csv", index=False)
df3.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructor_standings.csv", index=False)
df4.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_constructors.csv", index=False)
df5.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_driver_standings.csv", index=False)
df6.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_drivers.csv", index=False)
df7.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_lap_times.csv", index=False)
df8.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_pit_stops.csv", index=False)
df9.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_qualifying.csv", index=False)
df10.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_races.csv", index=False)
df11.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_results.csv", index=False)
df12.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_seasons.csv", index=False)
df13.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_sprint_results.csv", index=False)
df14.to_csv(r"C:\Users\sulet\Desktop\F1_History_Cleaned\cleaned_status.csv", index=False)